{
  "basics": {
    "name": "Shushu Wu",
    "email": "ciel77@sjtu.edu.cn",
    "phone": "",
    "website": "https://academicpages.github.io",
    "summary": "I am a Ph.D. student in the Programming Language Group at Shanghai Jiao Tong University, supervised by Prof. Qinxiang Cao. My research focuses on program verification, with particular emphasis on Separation Logic and Relational Hoare Logic. I am especially interested in developing scalable, modular tools to ensure the safety and correctness of programs.",
    "location": {
      "address": "",
      "postalCode": "",
      "city": "Shanghai",
      "countryCode": "CN",
      "region": ""
    },
    "profiles": [
      {
        "network": "GitHub",
        "username": "CielSeven",
        "url": "https://github.com/CielSeven"
      }
    ]
  },
  "work": [],
  "education": [
    {
      "institution": "Shanghai Jiao Tong University",
      "area": "Computer Science",
      "studyType": "Ph.D.",
      "startDate": "Sep 2021",
      "endDate": "Present",
      "gpa": null,
      "courses": [
        "Focus: Separation Logic, Relational Hoare Logic, Algorithm Verification, Monads",
        "Supervisor: Qinxiang Cao, Associate Professor"
      ]
    },
    {
      "institution": "Shanghai Jiao Tong University",
      "area": "Computer Science",
      "studyType": "Bachelor",
      "startDate": "Sep 2017",
      "endDate": "June 2021",
      "gpa": null,
      "courses": [
        "Thesis: Functional Correctness Verification of the Red-Black Tree and Its C Implementation",
        "Supervisor: Qinxiang Cao, Associate Professor"
      ]
    }
  ],
  "research": [
    {
      "title": "Loop Invariant Generation Based on Large Language Models",
      "startDate": "2025",
      "endDate": "present",
      "summary": "Automatically generates separation logic invariants and abstract program fragments, supporting end-to-end automation for program refinement verification.",
      "highlights": [
        "Perform symbolic execution on C programs to obtain verification conditions; generate spatial predicate invariants using in-context learning and expert correction methods.",
        "Convert spatial predicates within invariants into separation logic predicates with abstract data, and generate corresponding abstract code fragments.",
        "Successfully generated valid invariants and abstract fragments for linked-list-based programs (e.g., insertions, deletions, reversals)."
      ]
    },
    {
      "title": "QCP: A Practical Separation Logic-based C Program Verification Tool",
      "startDate": "2022",
      "endDate": "present",
      "summary": "Qualified C Programming Verifier (QCP), a verification tool that integrates annotation-based automatic verification with interactive proving using Rocq.",
      "highlights": [
        "Perform symbolic execution on annotated C programs to generate verification conditions automatically.",
        "SMT solvers verify most conditions automatically, while remaining subgoals are proved interactively using Rocq."
      ]
    },
    {
      "title": "Imperative Program Verification in Two Phases",
      "startDate": "2019",
      "endDate": "2021",
      "summary": "Introduced a flexible two-phase method for verifying imperative programs, which involves separating the verification process into proving the algorithm's correctness and proving the implementation refines the algorithm.",
      "highlights": [
        "Implemented an iterative version of red-black trees with lazy-tagging in Rocq.",
        "Proved the correctness of the imperative C implementation of the Red-Black Tree algorithm in Verified Software Toolchain (VST) with respect to the algorithm description."
      ]
    }
  ],
  "projects": [
    {
      "title": "Formal Verification of LiteOS-M Operating System Kernel",
      "organization": "ZGC Lab, Beijing, China",
      "startDate": "2024",
      "endDate": "present",
      "summary": "Focused on the core modules of a specific LiteOS-M kernel version, proving the refinement relationship between C programs and abstract programs within the modules using tool QCP."
    },
    {
      "title": "Formal Verification of XX Microkernel Operating System",
      "organization": "Industry, China",
      "startDate": "2021",
      "endDate": "2023",
      "summary": "The system is based on a mature embedded OS with multi-core DSP optimizations. Verifying the correctness of critical kernel modules using concurrent relational logic."
    }
  ],
  "skills": [
    {
      "name": "Theorem Prover",
      "level": "",
      "keywords": ["Rocq"]
    },
    {
      "name": "Programming Languages",
      "level": "",
      "keywords": ["C", "C++", "Python", "Rust", "OCaml", "Haskell"]
    },
    {
      "name": "Natural Languages",
      "level": "",
      "keywords": ["Chinese (native speaker)", "English (fluent)"]
    }
  ],
  "languages": [],
  "interests": [],
  "references": [],
  "publications": [
    {
      "name": "Encode the ∀∃ Relational Hoare Logic into Standard Hoare Logic",
      "publisher": "OOPSLA 2025",
      "releaseDate": "2025-10-01",
      "website": "",
      "summary": "Shushu Wu, Xiwei Wu, and Qinxiang Cao."
    },
    {
      "name": "A Formal Framework for Naturally Specifying and Verifying Sequential Algorithms",
      "publisher": "TASE 2025",
      "releaseDate": "2025-06-08",
      "website": "",
      "summary": "Chengxi Yang*, Shushu Wu*, Qinxiang Cao."
    },
    {
      "name": "Relational Hoare Logic for Sequential Program Verification",
      "publisher": "SRC at POPL 2025",
      "releaseDate": "2025-01-01",
      "website": "",
      "summary": "Shushu Wu."
    }
  ],
  "presentations": [],
  "teaching": [
    {
      "course": "CS1601 Discrete Mathematics",
      "institution": "Shanghai Jiao Tong University",
      "date": "2024-09-01",
      "role": "Teaching Assistant",
      "description": "Fall 2024"
    },
    {
      "course": "CS2612 Programming Languages and Compilers",
      "institution": "Shanghai Jiao Tong University",
      "date": "2023-09-01",
      "role": "Teaching Assistant",
      "description": "Fall 2023"
    }
  ],
  "portfolio": []
}
